<template>
<div>

    <aplayer :audio="audio"
             :lrcType="1" />
    <!--<audio src="../assets/song/NoTitle.mp3" controls ></audio>-->
</div>
</template>

<script>
export default {
  name: "BlogContent",
  data(){
    return {
      audio:{
        name: 'No title',
        artist: 'れをる,ギガP',
        url: require('../assets/song/NoTitle.mp3'),
        cover: require('../assets/song/NoTitle.jpg'),
        lrc:"[00:09.790]能否成为一直憧憬着的我呢\n" +
            "[00:11.539]好像来到了已经完全回不去的地方了\n" +
            "[00:14.220]凭借自己的双脚二段跳\n" +
            "[00:16.469]没错 应该还能更快的向前奔跑 所以 奔跑\n" +
            "[00:19.180]缝补起逐渐加深的伤口\n" +
            "[00:21.750]开始以连接为轴旋转\n" +
            "[00:24.120]已经习惯的疼痛 急促起来的呼吸与心跳\n" +
            "[00:26.299]对其佯装不知仍独自一人\n" +
            "[00:28.620]什么是正确的？没有什么永远啊\n" +
            "[00:30.930]谁在付出着错误的回报\n" +
            "[00:33.389]你所讨厌的那家伙也一定只是说着\n" +
            "[00:36.200]「仅此而已」的错误答案\n" +
            "[00:38.310]就算提出零分的建议也完全没有接受的理由\n" +
            "[00:42.990]最前线无论何时都是这里\n" +
            "[00:45.209]最上策从一开始就不存在\n" +
            "[00:47.630]缓缓地逐渐崩坏\n" +
            "[00:52.349]慢慢地慢慢地像被勒紧脖子一般地\n" +
            "[00:54.729]把直到昨天为止的我逐渐杀死\n" +
            "[00:57.130]缓缓地对分离感到了厌烦\n" +
            "[01:01.759]摇摇欲坠的你所听到的\n" +
            "[01:04.150]逐渐变为我所不知道的声音\n" +
            "[01:06.870]\n" +
            "[01:16.550]从小时候开始\n" +
            "[01:18.940]察觉到你就已在我身边\n" +
            "[01:21.379]就好像是空气一般\n" +
            "[01:23.809]我与你紧紧将手相连\n" +
            "[01:26.199]开心的事也好 悲伤的事也好\n" +
            "[01:28.309]我都会跟你诉说\n" +
            "[01:30.589]你就好像是听不见嘲笑我的人或是贬低我的声音一般歌唱着\n" +
            "[01:35.699]你收听着这份声音\n" +
            "[01:37.830]每个夜晚都被投影的忧郁\n" +
            "[01:40.389]就算用旧了舍弃了腐朽了\n" +
            "[01:42.769]也停不下来的高度的时代精神\n" +
            "[01:45.279]在旋转的一周之间仅有一瞬相交的心跳、声音、连接的颜色\n" +
            "[01:52.250]接下来就由我来为你歌唱吧\n" +
            "[01:55.100]缓缓地逐渐崩坏\n" +
            "[01:59.489]慢慢地慢慢地像被勒紧脖子一般地\n" +
            "[02:01.680]把直到昨天为止的我逐渐杀死\n" +
            "[02:04.269]缓缓地对分离感到了厌烦\n" +
            "[02:09.000]摇摇欲坠的你所听到的\n" +
            "[02:11.380]逐渐变为我所不知道的声音\n" +
            "[02:14.290]缓缓地逐渐崩坏\n" +
            "[02:18.490]慢慢地慢慢地像被勒紧脖子一般地\n" +
            "[02:20.979]把直到昨天为止的我逐渐杀死\n" +
            "[02:23.449]缓缓地对分离感到了厌烦\n" +
            "[02:28.339]摇摇欲坠的你所听到的\n" +
            "[02:30.610]逐渐变为我所不知道的声音\n" +
            "[02:33.600]什么时候才能传达给你呢\n" +
            "[02:35.520]那一天一定不会到来了吧\n" +
            "[02:38.390]我只是为声音和形体都不具备的你\n" +
            "[02:40.710]所拯救的数亿人中的一人\n" +
            "[02:43.000]红蓝色交织的声音充满了这个世界\n" +
            "[02:47.500]听到不断巡回相遇的这声音的一切都是\n" +
            "[02:53.559]缓缓地逐渐崩坏\n" +
            "[02:58.289]慢慢地慢慢地像被勒紧脖子一般地\n" +
            "[03:00.649]把直到昨天为止的我逐渐杀死\n" +
            "[03:03.179]缓缓地对分离感到了厌烦\n" +
            "[03:07.860]摇摇欲坠的你所听到的\n" +
            "[03:10.259]逐渐变为我所不知道的声音\n" +
            "[03:13.190]缓缓地逐渐崩坏\n" +
            "[03:17.639]慢慢地慢慢地像被勒紧脖子一般地\n" +
            "[03:19.770]把直到昨天为止的我逐渐杀死\n" +
            "[03:22.310]缓缓地对分离感到了厌烦\n" +
            "[03:27.190]摇摇欲坠的你所听到的\n" +
            "[03:29.389]逐渐变为我所不知道的声音\n"
      },

    }
  }
}
</script>

<style scoped>

</style>